espressif/esp-idf/components/soc/esp32s31/register/soc/lp_pwr_struct.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include <stdint.h>
#ifdef __cplusplus
extern "C" {
#endif

/** Group: configure_register */
/** Type of lpcpu_cfg register
 *  config register for lpcpu power control
 */
typedef union {
    struct {
        /** lpcpu_stall_wait_timer : R/W; bitpos: [7:0]; default: 0;
         *  stall wait timer for lpcpu during lpcpu power off sequence
         */
        uint32_t lpcpu_stall_wait_timer:8;
        /** lpcpu_stall_flag_en : R/W; bitpos: [8]; default: 1;
         *  1: wait for stall rdy input during lpcpu power off sequence
         *  0:do not wait for stall rdy during lpcpu power off sequence
         */
        uint32_t lpcpu_stall_flag_en:1;
        /** lpcpu_stall_en : R/W; bitpos: [9]; default: 1;
         *  1: enable lpcpu stall during lpcpu power off sequence
         *  0: disable lpcpu stall during lpcpu power off sequence
         */
        uint32_t lpcpu_stall_en:1;
        /** lpcpu_reset_en : R/W; bitpos: [10]; default: 1;
         *  1: enable lpcpu reset during lpcpu power off sequence
         *  0: disable lpcpu reset during lpcpu power off sequence
         */
        uint32_t lpcpu_reset_en:1;
        /** lpcpu_slp_waiti_flag_en : R/W; bitpos: [11]; default: 0;
         *  1: validates lp cpu waiti rdy signal during lpcpu power off sequence
         *  0: invalidates lp cpu waiti rdy signal during lpcpu power off sequence
         */
        uint32_t lpcpu_slp_waiti_flag_en:1;
        /** lpcpu_slp_bypass_intr_en : R/W; bitpos: [12]; default: 0;
         *  1: enable interrupt bypass signal for lpcpu during lpcpu power off sequence
         *  0: disable interrupt bypass signal for lpcpu during lpcpu power off sequence
         */
        uint32_t lpcpu_slp_bypass_intr_en:1;
        uint32_t reserved_13:19;
    };
    uint32_t val;
} lp_pwr_lpcpu_cfg_reg_t;

/** Type of lpcpu_sts register
 *  status register for LPCPU PWR
 */
typedef union {
    struct {
        /** lpcpu_cur_st : RO; bitpos: [3:0]; default: 4;
         *  current power state register for lpcpu
         */
        uint32_t lpcpu_cur_st:4;
        /** lpcpu_in_power_on : RO; bitpos: [4]; default: 0;
         *  1:lpcpu current in power on mode
         *  0:lpcpu not in power on mode
         */
        uint32_t lpcpu_in_power_on:1;
        /** lpcpu_stall_rdy : RO; bitpos: [5]; default: 0;
         *  1:lpcpu stall not ready
         *  0:lpcpu stall ready
         */
        uint32_t lpcpu_stall_rdy:1;
        /** lpcpu_waiti_rdy : RO; bitpos: [6]; default: 0;
         *  1:lpcpu stall waiti ready
         *  0:lpcpu stall waiti ready
         */
        uint32_t lpcpu_waiti_rdy:1;
        uint32_t reserved_7:25;
    };
    uint32_t val;
} lp_pwr_lpcpu_sts_reg_t;

/** Type of lpcpu_ctrl register
 *  ctrl register for lpcpu power control
 */
typedef union {
    struct {
        /** lpcpu_sw_sleep_req : WT; bitpos: [0]; default: 0;
         *  software sleep request config for lpcpu
         */
        uint32_t lpcpu_sw_sleep_req:1;
        /** lpcpu_sw_wakeup_req : WT; bitpos: [1]; default: 0;
         *  software wakeup request config for lpcpu
         */
        uint32_t lpcpu_sw_wakeup_req:1;
        /** lpcpu_force_stall : R/W; bitpos: [2]; default: 0;
         *  1: force stall lpcpu
         *  0: no change
         */
        uint32_t lpcpu_force_stall:1;
        /** lpcpu_force_reset : R/W; bitpos: [3]; default: 0;
         *  1: force reset lpcpu
         *  0: no change
         */
        uint32_t lpcpu_force_reset:1;
        /** lpcpu_force_no_reset : R/W; bitpos: [4]; default: 0;
         *  1: force no reset lpcpu
         *  0: no change
         */
        uint32_t lpcpu_force_no_reset:1;
        uint32_t reserved_5:27;
    };
    uint32_t val;
} lp_pwr_lpcpu_ctrl_reg_t;

/** Type of lpcpu_wakeup_src register
 *  wakeup source register for lpcpu
 */
typedef union {
    struct {
        /** lpcpu_wakeup_source_en : R/W; bitpos: [30:0]; default: 0;
         *  wakeup source enable signal for lpcpu
         */
        uint32_t lpcpu_wakeup_source_en:31;
        uint32_t reserved_31:1;
    };
    uint32_t val;
} lp_pwr_lpcpu_wakeup_src_reg_t;

/** Type of lpcpu_reject_src register
 *  reject source register for lpcpu
 */
typedef union {
    struct {
        /** lpcpu_reject_source_en : R/W; bitpos: [30:0]; default: 0;
         *  reject source enable signal for lpcpu
         */
        uint32_t lpcpu_reject_source_en:31;
        /** lpcpu_sleep_reject_en : R/W; bitpos: [31]; default: 0;
         *  1: sleep request can be rejected
         *  0: sleep request cannot be rejected
         */
        uint32_t lpcpu_sleep_reject_en:1;
    };
    uint32_t val;
} lp_pwr_lpcpu_reject_src_reg_t;

/** Type of lpcpu_wakeup_cause register
 *  wakeup cause register for lpcpu
 */
typedef union {
    struct {
        /** lpcpu_wakeup_cause : RO; bitpos: [30:0]; default: 0;
         *  wakeup cause for lpcpu
         */
        uint32_t lpcpu_wakeup_cause:31;
        uint32_t reserved_31:1;
    };
    uint32_t val;
} lp_pwr_lpcpu_wakeup_cause_reg_t;

/** Type of lpcpu_reject_cause register
 *  reject cause register for lpcpu
 */
typedef union {
    struct {
        /** lpcpu_reject_cause : RO; bitpos: [30:0]; default: 0;
         *  reject cause for lpcpu
         */
        uint32_t lpcpu_reject_cause:31;
        uint32_t reserved_31:1;
    };
    uint32_t val;
} lp_pwr_lpcpu_reject_cause_reg_t;

/** Type of lpcpu_cause_clr register
 *  cause clear register for lpcpu
 */
typedef union {
    struct {
        /** lpcpu_reject_cause_clr : WT; bitpos: [0]; default: 0;
         *  reject cause clear signal for lpcpu
         */
        uint32_t lpcpu_reject_cause_clr:1;
        /** lpcpu_wakeup_cause_clr : WT; bitpos: [1]; default: 0;
         *  wakeup cause clear signal for lpcpu
         */
        uint32_t lpcpu_wakeup_cause_clr:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} lp_pwr_lpcpu_cause_clr_reg_t;

