espressif/esp-idf/components/soc/esp32s31/register/soc/lp_pwr_struct.h
/** Type of appwr_pwr_cfg register
 *  config register for apsys pwr and clk mode
 */
typedef union {
    struct {
        /** cpu_pwr_mode : R/W; bitpos: [1:0]; default: 2;
         *  cpu pwr mode config register for apsys
         */
        uint32_t cpu_pwr_mode:2;
        /** top_pwr_mode : R/W; bitpos: [3:2]; default: 2;
         *  top pwr mode config register for apsys
         */
        uint32_t top_pwr_mode:2;
        /** cnnt_pwr_mode : R/W; bitpos: [5:4]; default: 2;
         *  cnnt pwr mode config register for apsys
         */
        uint32_t cnnt_pwr_mode:2;
        /** hpalive_pwr_mode : R/W; bitpos: [7:6]; default: 2;
         *  hpalive pwr mode config register for apsys
         */
        uint32_t hpalive_pwr_mode:2;
        /** mem_0_pwr_mode : R/W; bitpos: [9:8]; default: 2;
         *  mem_0 pwr mode config register for apsys
         */
        uint32_t mem_0_pwr_mode:2;
        /** mem_1_pwr_mode : R/W; bitpos: [11:10]; default: 2;
         *  mem_1 pwr mode config register for apsys
         */
        uint32_t mem_1_pwr_mode:2;
        /** mem_2_pwr_mode : R/W; bitpos: [13:12]; default: 2;
         *  mem_2 pwr mode config register for apsys
         */
        uint32_t mem_2_pwr_mode:2;
        /** mem_3_pwr_mode : R/W; bitpos: [15:14]; default: 2;
         *  mem_3 pwr mode config register for apsys
         */
        uint32_t mem_3_pwr_mode:2;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} lp_pwr_appwr_pwr_cfg_reg_t;

/** Type of appwr_clk_cfg register
 *  config register for apsys pwr and clk mode
 */
typedef union {
    struct {
        /** cpu_clk_mode : R/W; bitpos: [1:0]; default: 3;
         *  cpu clk mode config register for apsys
         */
        uint32_t cpu_clk_mode:2;
        /** top_clk_mode : R/W; bitpos: [3:2]; default: 3;
         *  top clk mode config register for apsys
         */
        uint32_t top_clk_mode:2;
        /** cnnt_clk_mode : R/W; bitpos: [5:4]; default: 3;
         *  cnnt clk mode config register for apsys
         */
        uint32_t cnnt_clk_mode:2;
        /** hpalive_clk_mode : R/W; bitpos: [7:6]; default: 3;
         *  hpalive clk mode config register for apsys
         */
        uint32_t hpalive_clk_mode:2;
        /** mem_0_clk_mode : R/W; bitpos: [9:8]; default: 3;
         *  mem_0 clk mode config register for apsys
         */
        uint32_t mem_0_clk_mode:2;
        /** mem_1_clk_mode : R/W; bitpos: [11:10]; default: 3;
         *  mem_1 clk mode config register for apsys
         */
        uint32_t mem_1_clk_mode:2;
        /** mem_2_clk_mode : R/W; bitpos: [13:12]; default: 3;
         *  mem_2 clk mode config register for apsys
         */
        uint32_t mem_2_clk_mode:2;
        /** mem_3_clk_mode : R/W; bitpos: [15:14]; default: 3;
         *  mem_3 clk mode config register for apsys
         */
        uint32_t mem_3_clk_mode:2;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} lp_pwr_appwr_clk_cfg_reg_t;

/** Type of appwr_cfg register
 *  config register for apsys pwr
 */
typedef union {
    struct {
        /** stall_wait_timer : R/W; bitpos: [7:0]; default: 0;
         *  the wait timer config for ap sys
         */
        uint32_t stall_wait_timer:8;
        /** backup_en : R/W; bitpos: [8]; default: 0;
         *  the backup enable config register for ap sys
         */
        uint32_t backup_en:1;
        /** restore_mode : R/W; bitpos: [13:9]; default: 0;
         *  restore mode config register for apsys
         */
        uint32_t restore_mode:5;
        /** backup_mode : R/W; bitpos: [18:14]; default: 0;
         *  backup mode config register for apsys
         */
        uint32_t backup_mode:5;
        /** hpcpu_stall_en : R/W; bitpos: [19]; default: 1;
         *  1: enable hpcpu stall
         *  0: disable hpcpu stall
         */
        uint32_t hpcpu_stall_en:1;
        uint32_t reserved_20:12;
    };
    uint32_t val;
} lp_pwr_appwr_cfg_reg_t;

/** Type of appwr_sts register
 *  status register for apsys pwr
 */
typedef union {
    struct {
        /** appwr_cur_st : RO; bitpos: [3:0]; default: 6;
         *  current power state register for apsys
         */
        uint32_t appwr_cur_st:4;
        /** apsys_in_power_on : RO; bitpos: [4]; default: 0;
         *  1:apsys current in power on mode
         *  0:apsys not in power on mode
         */
        uint32_t apsys_in_power_on:1;
        uint32_t reserved_5:27;
    };
    uint32_t val;
} lp_pwr_appwr_sts_reg_t;

/** Type of appwr_ctrl register
 *  ctrl register for appwr power control
 */
typedef union {
    struct {
        /** appwr_sw_sleep_req : WT; bitpos: [0]; default: 0;
         *  software sleep request config for appwr
         */
        uint32_t appwr_sw_sleep_req:1;
        /** appwr_sw_wakeup_req : WT; bitpos: [1]; default: 0;
         *  software wakeup request config for appwr
         */
        uint32_t appwr_sw_wakeup_req:1;
        /** hpcpu_force_stall : R/W; bitpos: [2]; default: 0;
         *  1: force stall hpcpu
         *  0: no change
         */
        uint32_t hpcpu_force_stall:1;
        uint32_t reserved_3:29;
    };
    uint32_t val;
} lp_pwr_appwr_ctrl_reg_t;

/** Type of appwr_wakeup_src register
 *  wakeup source register for appwr
 */
typedef union {
    struct {
        /** appwr_wakeup_source_en : R/W; bitpos: [30:0]; default: 0;
         *  wakeup enable signal for appwr
         */
        uint32_t appwr_wakeup_source_en:31;
        uint32_t reserved_31:1;
    };
    uint32_t val;
} lp_pwr_appwr_wakeup_src_reg_t;

/** Type of appwr_reject_src register
 *  reject source register for appwr
 */
typedef union {
    struct {
        /** appwr_reject_source_en : R/W; bitpos: [30:0]; default: 0;
         *  reject enable signal for appwr
         */
        uint32_t appwr_reject_source_en:31;
        /** appwr_sleep_reject_en : R/W; bitpos: [31]; default: 0;
         *  1: sleep request can be rejected
         *  0: sleep request cannot be rejected
         */
        uint32_t appwr_sleep_reject_en:1;
    };
    uint32_t val;
} lp_pwr_appwr_reject_src_reg_t;

/** Type of appwr_wakeup_cause register
 *  wakeup cause register for appwr
 */
typedef union {
    struct {
        /** appwr_wakeup_cause : RO; bitpos: [30:0]; default: 0;
         *  wakeup cause for appwr
         */
        uint32_t appwr_wakeup_cause:31;
        uint32_t reserved_31:1;
    };
    uint32_t val;
} lp_pwr_appwr_wakeup_cause_reg_t;

