espressif/esp-idf/components/soc/esp32s31/register/soc/lp_pwr_struct.h
/** Type of appwr_reject_cause register
 *  reject cause register for appwr
 */
typedef union {
    struct {
        /** appwr_reject_cause : RO; bitpos: [30:0]; default: 0;
         *  reject cause for appwr
         */
        uint32_t appwr_reject_cause:31;
        uint32_t reserved_31:1;
    };
    uint32_t val;
} lp_pwr_appwr_reject_cause_reg_t;

/** Type of appwr_cause_clr register
 *  cause clear register for appwr
 */
typedef union {
    struct {
        /** appwr_reject_cause_clr : WT; bitpos: [0]; default: 0;
         *  reject cause clear signal for appwr
         */
        uint32_t appwr_reject_cause_clr:1;
        /** appwr_wakeup_cause_clr : WT; bitpos: [1]; default: 0;
         *  wakeup cause clear signal for appwr
         */
        uint32_t appwr_wakeup_cause_clr:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} lp_pwr_appwr_cause_clr_reg_t;

/** Type of wifi_ctrl register
 *  ctrl register for wifi power control
 */
typedef union {
    struct {
        /** wifi_sw_sleep_req : WT; bitpos: [0]; default: 0;
         *  software sleep request config for wifi
         */
        uint32_t wifi_sw_sleep_req:1;
        /** wifi_sw_wakeup_req : WT; bitpos: [1]; default: 0;
         *  software wakeup request config for wifi
         */
        uint32_t wifi_sw_wakeup_req:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} lp_pwr_wifi_ctrl_reg_t;

/** Type of wifi_wakeup_src register
 *  wakeup source register for wifi
 */
typedef union {
    struct {
        /** wifi_wakeup_source_en : R/W; bitpos: [30:0]; default: 0;
         *  wakeup enable signal for wifi
         */
        uint32_t wifi_wakeup_source_en:31;
        uint32_t reserved_31:1;
    };
    uint32_t val;
} lp_pwr_wifi_wakeup_src_reg_t;

/** Type of ble_ctrl register
 *  ctrl register for ble power control
 */
typedef union {
    struct {
        /** ble_sw_sleep_req : WT; bitpos: [0]; default: 0;
         *  software sleep request config for ble
         */
        uint32_t ble_sw_sleep_req:1;
        /** ble_sw_wakeup_req : WT; bitpos: [1]; default: 0;
         *  software wakeup request config for ble
         */
        uint32_t ble_sw_wakeup_req:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} lp_pwr_ble_ctrl_reg_t;

/** Type of ble_wakeup_src register
 *  wakeup source register for ble
 */
typedef union {
    struct {
        /** ble_wakeup_source_en : R/W; bitpos: [30:0]; default: 0;
         *  wakeup enable signal for ble
         */
        uint32_t ble_wakeup_source_en:31;
        uint32_t reserved_31:1;
    };
    uint32_t val;
} lp_pwr_ble_wakeup_src_reg_t;

/** Type of zb_ctrl register
 *  ctrl register for zb power control
 */
typedef union {
    struct {
        /** zb_sw_sleep_req : WT; bitpos: [0]; default: 0;
         *  software sleep request config for zb
         */
        uint32_t zb_sw_sleep_req:1;
        /** zb_sw_wakeup_req : WT; bitpos: [1]; default: 0;
         *  software wakeup request config for zb
         */
        uint32_t zb_sw_wakeup_req:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} lp_pwr_zb_ctrl_reg_t;

/** Type of zb_wakeup_src register
 *  wakeup source register for zb
 */
typedef union {
    struct {
        /** zb_wakeup_source_en : R/W; bitpos: [30:0]; default: 0;
         *  wakeup enazb signal for zb
         */
        uint32_t zb_wakeup_source_en:31;
        uint32_t reserved_31:1;
    };
    uint32_t val;
} lp_pwr_zb_wakeup_src_reg_t;

/** Type of modempwr_ctrl register
 *  ctrl register for modempwr power control
 */
typedef union {
    struct {
        /** modempwr_sw_sleep_req : WT; bitpos: [0]; default: 0;
         *  software sleep request config for modempwr
         */
        uint32_t modempwr_sw_sleep_req:1;
        /** modempwr_sw_wakeup_req : WT; bitpos: [1]; default: 0;
         *  software wakeup request config for modempwr
         */
        uint32_t modempwr_sw_wakeup_req:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} lp_pwr_modempwr_ctrl_reg_t;

/** Type of modempwr_wakeup_src register
 *  wakeup source register for modempwr
 */
typedef union {
    struct {
        /** modempwr_wakeup_source_en : R/W; bitpos: [30:0]; default: 0;
         *  wakeup enable signal for modempwr
         */
        uint32_t modempwr_wakeup_source_en:31;
        uint32_t reserved_31:1;
    };
    uint32_t val;
} lp_pwr_modempwr_wakeup_src_reg_t;

/** Type of peri_pad_wake_slp_en register
 *  used for future potential eco, others don't care
 */
typedef union {
    struct {
        /** uart_wakeup_en : R/W; bitpos: [0]; default: 0;
         *  1:enables uart wakeup after hpcpu stall
         *  0:disables uart wakeup after hpcpu stall
         */
        uint32_t uart_wakeup_en:1;
        /** hp_pad_slp_sel : R/W; bitpos: [1]; default: 0;
         *  1:hppad will sleep after hpcpu stall
         *  0:hppad will not sleep after hpcpu stall
         */
        uint32_t hp_pad_slp_sel:1;
        /** lp_pad_slp_sel : R/W; bitpos: [2]; default: 0;
         *  1:hppad will sleep after hpcpu stall
         *  0:hppad will not sleep after hpcpu stall
         */
        uint32_t lp_pad_slp_sel:1;
        uint32_t reserved_3:29;
    };
    uint32_t val;
} lp_pwr_peri_pad_wake_slp_en_reg_t;

/** Type of touch_ctrl register
 *  ctrl register for touch power control
 */
typedef union {
    struct {
        /** touch_sw_sleep_req : WT; bitpos: [0]; default: 0;
         *  software sleep request config for touch
         */
        uint32_t touch_sw_sleep_req:1;
        /** touch_sw_wakeup_req : WT; bitpos: [1]; default: 0;
         *  software wakeup request config for touch
         */
        uint32_t touch_sw_wakeup_req:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} lp_pwr_touch_ctrl_reg_t;

/** Type of touch_cfg register
 *  ctrl register for touch power control
 */
typedef union {
    struct {
        /** touch_sleep_cycles : R/W; bitpos: [25:0]; default: 100;
         *  sleep cycles config for touch
         */
        uint32_t touch_sleep_cycles:26;
        /** touch_sleep_timer_en : R/W; bitpos: [26]; default: 0;
         *  1:enables touch timer wakeup source
         *  0:disables touch timer wakeup source
         */
        uint32_t touch_sleep_timer_en:1;
        /** touch_force_done : R/W; bitpos: [27]; default: 0;
         *  1: force touch task to done state, turn off touch
         *  0: no effect
         */
        uint32_t touch_force_done:1;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} lp_pwr_touch_cfg_reg_t;

