espressif/esp-idf/components/soc/esp32s31/register/soc/lp_pwr_struct.h
/** Type of touch_sts register
 *  status register for TOUCH PWR
 */
typedef union {
    struct {
        /** touch_cur_st : RO; bitpos: [2:0]; default: 4;
         *  current power state register for touch
         */
        uint32_t touch_cur_st:3;
        /** touch_in_power_on : RO; bitpos: [3]; default: 0;
         *  1:touch current in power on mode
         *  0:touch not in power on mode
         */
        uint32_t touch_in_power_on:1;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} lp_pwr_touch_sts_reg_t;

/** Type of cali_ctrl register
 *  ctrl register for cali power control
 */
typedef union {
    struct {
        /** cali_sw_sleep_req : WT; bitpos: [0]; default: 0;
         *  software sleep request config for cali
         */
        uint32_t cali_sw_sleep_req:1;
        /** cali_sw_wakeup_req : WT; bitpos: [1]; default: 0;
         *  software wakeup request config for cali
         */
        uint32_t cali_sw_wakeup_req:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} lp_pwr_cali_ctrl_reg_t;

/** Type of cali_sts register
 *  status register for CALI PWR
 */
typedef union {
    struct {
        /** cali_cur_st : RO; bitpos: [2:0]; default: 4;
         *  current power state register for cali
         */
        uint32_t cali_cur_st:3;
        /** cali_in_power_on : RO; bitpos: [3]; default: 0;
         *  1:cali current in power on mode
         *  0:cali not in power on mode
         */
        uint32_t cali_in_power_on:1;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} lp_pwr_cali_sts_reg_t;

/** Type of lpperi_pwr_clk_cfg register
 *  ctrl register for lpcpu power clock mode control
 */
typedef union {
    struct {
        /** lpperi_sw_clk_mode : R/W; bitpos: [1:0]; default: 3;
         *  software configs LPPERI clk mode
         */
        uint32_t lpperi_sw_clk_mode:2;
        /** lpperi_sw_pwr_mode : R/W; bitpos: [3:2]; default: 2;
         *  software configs LPPERI pwr mode
         */
        uint32_t lpperi_sw_pwr_mode:2;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} lp_pwr_lpperi_pwr_clk_cfg_reg_t;

/** Type of lpperi_ctrl register
 *  ctrl register for lpperi power control
 */
typedef union {
    struct {
        /** lpperi_sw_force_on : R/W; bitpos: [0]; default: 1;
         *  1: software wake lpperi
         */
        uint32_t lpperi_sw_force_on:1;
        /** lpperi_sw_req : WT; bitpos: [1]; default: 0;
         *  software req  pulse for following mode register
         */
        uint32_t lpperi_sw_req:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} lp_pwr_lpperi_ctrl_reg_t;

/** Type of lp_pad_cfg register
 *  config register for lppad hold signal
 */
typedef union {
    struct {
        /** lppad_hold_cpu_pause_en : R/W; bitpos: [0]; default: 0;
         *  1: hold lppad when hpcpu stalls
         *  0: not hold lppad when hpcpu stalls
         */
        uint32_t lppad_hold_cpu_pause_en:1;
        /** force_high_lp_pad_hold : R/W; bitpos: [1]; default: 0;
         *  1:force pull up lppad hold signal
         *  0:no effect
         */
        uint32_t force_high_lp_pad_hold:1;
        /** force_low_lp_pad_hold : R/W; bitpos: [2]; default: 0;
         *  1:force pull low lppad hold signal
         *  0:no effect
         */
        uint32_t force_low_lp_pad_hold:1;
        uint32_t reserved_3:29;
    };
    uint32_t val;
} lp_pwr_lp_pad_cfg_reg_t;

/** Type of cnnt_pad_cfg register
 *  config register for cnntpad hold signal
 */
typedef union {
    struct {
        /** cnnt_pad_hold_cpu_pause_en : R/W; bitpos: [0]; default: 0;
         *  1: hold cnntpad when hpcpu stalls
         *  0: not hold cnntpad when hpcpu stalls
         */
        uint32_t cnnt_pad_hold_cpu_pause_en:1;
        /** force_high_cnnt_pad_hold : R/W; bitpos: [1]; default: 0;
         *  1:force pull up cnntpad hold signal
         *  0:no effect
         */
        uint32_t force_high_cnnt_pad_hold:1;
        /** force_low_cnnt_pad_hold : R/W; bitpos: [2]; default: 0;
         *  1:force pull low cnntpad hold signal
         *  0:no effect
         */
        uint32_t force_low_cnnt_pad_hold:1;
        uint32_t reserved_3:29;
    };
    uint32_t val;
} lp_pwr_cnnt_pad_cfg_reg_t;

/** Type of hp_pad_cfg register
 *  config register for hppad hold signal
 */
typedef union {
    struct {
        /** hppad_hold_cpu_pause_en : R/W; bitpos: [0]; default: 0;
         *  1: hold hppad when hpcpu stalls
         *  0: not hold hppad when hpcpu stalls
         */
        uint32_t hppad_hold_cpu_pause_en:1;
        /** force_high_hp_pad_hold : R/W; bitpos: [1]; default: 0;
         *  1:force pull up hppad hold signal
         *  0:no effect
         */
        uint32_t force_high_hp_pad_hold:1;
        /** force_low_hp_pad_hold : R/W; bitpos: [2]; default: 0;
         *  1:force pull low hppad hold signal
         *  0:no effect
         */
        uint32_t force_low_hp_pad_hold:1;
        uint32_t reserved_3:29;
    };
    uint32_t val;
} lp_pwr_hp_pad_cfg_reg_t;

/** Type of int_raw register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:24;
        /** zb_wake_process_int_raw : R/WTC/SS; bitpos: [24]; default: 0;
         *  need_des
         */
        uint32_t zb_wake_process_int_raw:1;
        /** modempwr_wake_process_int_raw : R/WTC/SS; bitpos: [25]; default: 0;
         *  need_des
         */
        uint32_t modempwr_wake_process_int_raw:1;
        /** ble_wake_process_int_raw : R/WTC/SS; bitpos: [26]; default: 0;
         *  need_des
         */
        uint32_t ble_wake_process_int_raw:1;
        /** wifi_wake_process_int_raw : R/WTC/SS; bitpos: [27]; default: 0;
         *  need_des
         */
        uint32_t wifi_wake_process_int_raw:1;
        /** xtal_cali_wake_process_int_raw : R/WTC/SS; bitpos: [28]; default: 0;
         *  need_des
         */
        uint32_t xtal_cali_wake_process_int_raw:1;
        /** touch_wake_process_int_raw : R/WTC/SS; bitpos: [29]; default: 0;
         *  need_des
         */
        uint32_t touch_wake_process_int_raw:1;
        /** lpcpu_wake_process_int_raw : R/WTC/SS; bitpos: [30]; default: 0;
         *  need_des
         */
        uint32_t lpcpu_wake_process_int_raw:1;
        /** appwr_wake_process_int_raw : R/WTC/SS; bitpos: [31]; default: 0;
         *  need_des
         */
        uint32_t appwr_wake_process_int_raw:1;
    };
    uint32_t val;
} lp_pwr_int_raw_reg_t;

/** Type of int_st register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:24;
        /** zb_wake_process_int_st : RO; bitpos: [24]; default: 0;
         *  need_des
         */
        uint32_t zb_wake_process_int_st:1;
        /** modempwr_wake_process_int_st : RO; bitpos: [25]; default: 0;
         *  need_des
         */
        uint32_t modempwr_wake_process_int_st:1;
        /** ble_wake_process_int_st : RO; bitpos: [26]; default: 0;
         *  need_des
         */
        uint32_t ble_wake_process_int_st:1;
        /** wifi_wake_process_int_st : RO; bitpos: [27]; default: 0;
         *  need_des
         */
        uint32_t wifi_wake_process_int_st:1;
        /** xtal_cali_wake_process_int_st : RO; bitpos: [28]; default: 0;
         *  need_des
         */
        uint32_t xtal_cali_wake_process_int_st:1;
        /** touch_wake_process_int_st : RO; bitpos: [29]; default: 0;
         *  need_des
         */
        uint32_t touch_wake_process_int_st:1;
        /** lpcpu_wake_process_int_st : RO; bitpos: [30]; default: 0;
         *  need_des
         */
        uint32_t lpcpu_wake_process_int_st:1;
        /** appwr_wake_process_int_st : RO; bitpos: [31]; default: 0;
         *  need_des
         */
        uint32_t appwr_wake_process_int_st:1;
    };
    uint32_t val;
} lp_pwr_int_st_reg_t;

/** Type of int_ena register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:24;
        /** zb_wake_process_int_ena : R/W; bitpos: [24]; default: 0;
         *  need_des
         */
        uint32_t zb_wake_process_int_ena:1;
        /** modempwr_wake_process_int_ena : R/W; bitpos: [25]; default: 0;
         *  need_des
         */
        uint32_t modempwr_wake_process_int_ena:1;
        /** ble_wake_process_int_ena : R/W; bitpos: [26]; default: 0;
         *  need_des
         */
        uint32_t ble_wake_process_int_ena:1;
        /** wifi_wake_process_int_ena : R/W; bitpos: [27]; default: 0;
         *  need_des
         */
        uint32_t wifi_wake_process_int_ena:1;
        /** xtal_cali_wake_process_int_ena : R/W; bitpos: [28]; default: 0;
         *  need_des
         */
        uint32_t xtal_cali_wake_process_int_ena:1;
        /** touch_wake_process_int_ena : R/W; bitpos: [29]; default: 0;
         *  need_des
         */
        uint32_t touch_wake_process_int_ena:1;
        /** lpcpu_wake_process_int_ena : R/W; bitpos: [30]; default: 0;
         *  need_des
         */
        uint32_t lpcpu_wake_process_int_ena:1;
        /** appwr_wake_process_int_ena : R/W; bitpos: [31]; default: 0;
         *  need_des
         */
        uint32_t appwr_wake_process_int_ena:1;
    };
    uint32_t val;
} lp_pwr_int_ena_reg_t;

/** Type of int_clr register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:24;
        /** zb_wake_process_int_clr : WT; bitpos: [24]; default: 0;
         *  need_des
         */
        uint32_t zb_wake_process_int_clr:1;
        /** modempwr_wake_process_int_clr : WT; bitpos: [25]; default: 0;
         *  need_des
         */
        uint32_t modempwr_wake_process_int_clr:1;
        /** ble_wake_process_int_clr : WT; bitpos: [26]; default: 0;
         *  need_des
         */
        uint32_t ble_wake_process_int_clr:1;
        /** wifi_wake_process_int_clr : WT; bitpos: [27]; default: 0;
         *  need_des
         */
        uint32_t wifi_wake_process_int_clr:1;
        /** xtal_cali_wake_process_int_clr : WT; bitpos: [28]; default: 0;
         *  need_des
         */
        uint32_t xtal_cali_wake_process_int_clr:1;
        /** touch_wake_process_int_clr : WT; bitpos: [29]; default: 0;
         *  need_des
         */
        uint32_t touch_wake_process_int_clr:1;
        /** lpcpu_wake_process_int_clr : WT; bitpos: [30]; default: 0;
         *  need_des
         */
        uint32_t lpcpu_wake_process_int_clr:1;
        /** appwr_wake_process_int_clr : WT; bitpos: [31]; default: 0;
         *  need_des
         */
        uint32_t appwr_wake_process_int_clr:1;
    };
    uint32_t val;
} lp_pwr_int_clr_reg_t;

/** Type of ver_date register
 *  need_des
 */
typedef union {
    struct {
        /** ver_date : R/W; bitpos: [30:0]; default: 2426648;
         *  need_des
         */
        uint32_t ver_date:31;
        /** clk_en : R/W; bitpos: [31]; default: 0;
         *  need_des
         */
        uint32_t clk_en:1;
    };
    uint32_t val;
} lp_pwr_ver_date_reg_t;


