espressif/esp-idf/components/soc/esp32s31/register/soc/lp_pwr_struct.h
typedef struct {
    volatile lp_pwr_lpcpu_cfg_reg_t lpcpu_cfg;
    volatile lp_pwr_lpcpu_sts_reg_t lpcpu_sts;
    volatile lp_pwr_lpcpu_ctrl_reg_t lpcpu_ctrl;
    volatile lp_pwr_lpcpu_wakeup_src_reg_t lpcpu_wakeup_src;
    volatile lp_pwr_lpcpu_reject_src_reg_t lpcpu_reject_src;
    volatile lp_pwr_lpcpu_wakeup_cause_reg_t lpcpu_wakeup_cause;
    volatile lp_pwr_lpcpu_reject_cause_reg_t lpcpu_reject_cause;
    volatile lp_pwr_lpcpu_cause_clr_reg_t lpcpu_cause_clr;
    volatile lp_pwr_appwr_pwr_cfg_reg_t appwr_pwr_cfg;
    volatile lp_pwr_appwr_clk_cfg_reg_t appwr_clk_cfg;
    volatile lp_pwr_appwr_cfg_reg_t appwr_cfg;
    volatile lp_pwr_appwr_sts_reg_t appwr_sts;
    volatile lp_pwr_appwr_ctrl_reg_t appwr_ctrl;
    volatile lp_pwr_appwr_wakeup_src_reg_t appwr_wakeup_src;
    volatile lp_pwr_appwr_reject_src_reg_t appwr_reject_src;
    volatile lp_pwr_appwr_wakeup_cause_reg_t appwr_wakeup_cause;
    volatile lp_pwr_appwr_reject_cause_reg_t appwr_reject_cause;
    volatile lp_pwr_appwr_cause_clr_reg_t appwr_cause_clr;
    volatile lp_pwr_wifi_ctrl_reg_t wifi_ctrl;
    volatile lp_pwr_wifi_wakeup_src_reg_t wifi_wakeup_src;
    volatile lp_pwr_ble_ctrl_reg_t ble_ctrl;
    volatile lp_pwr_ble_wakeup_src_reg_t ble_wakeup_src;
    volatile lp_pwr_zb_ctrl_reg_t zb_ctrl;
    volatile lp_pwr_zb_wakeup_src_reg_t zb_wakeup_src;
    volatile lp_pwr_modempwr_ctrl_reg_t modempwr_ctrl;
    volatile lp_pwr_modempwr_wakeup_src_reg_t modempwr_wakeup_src;
    volatile lp_pwr_peri_pad_wake_slp_en_reg_t peri_pad_wake_slp_en;
    volatile lp_pwr_touch_ctrl_reg_t touch_ctrl;
    volatile lp_pwr_touch_cfg_reg_t touch_cfg;
    volatile lp_pwr_touch_sts_reg_t touch_sts;
    volatile lp_pwr_cali_ctrl_reg_t cali_ctrl;
    volatile lp_pwr_cali_sts_reg_t cali_sts;
    volatile lp_pwr_lpperi_pwr_clk_cfg_reg_t lpperi_pwr_clk_cfg;
    volatile lp_pwr_lpperi_ctrl_reg_t lpperi_ctrl;
    volatile lp_pwr_lp_pad_cfg_reg_t lp_pad_cfg;
    volatile lp_pwr_cnnt_pad_cfg_reg_t cnnt_pad_cfg;
    volatile lp_pwr_hp_pad_cfg_reg_t hp_pad_cfg;
    volatile lp_pwr_int_raw_reg_t int_raw;
    volatile lp_pwr_int_st_reg_t int_st;
    volatile lp_pwr_int_ena_reg_t int_ena;
    volatile lp_pwr_int_clr_reg_t int_clr;
    volatile lp_pwr_ver_date_reg_t ver_date;
} lp_pwr_dev_t;


extern lp_pwr_dev_t LP_PWR;

#ifndef __cplusplus
_Static_assert(sizeof(lp_pwr_dev_t) == 0xa8, "Invalid size of lp_pwr_dev_t structure");
#endif

#ifdef __cplusplus
}
#endif
